RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_flexio_spi.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2020, 2022, 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_flexio_spi.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.flexio_spi"
#endif

/*! @brief FLEXIO SPI transfer state, which is used for SPI transactiaonl APIs' internal state. */
enum _flexio_spi_transfer_states
{
    kFLEXIO_SPI_Idle = 0x0U, /*!< Nothing in the transmitter/receiver's queue. */
    kFLEXIO_SPI_Busy,        /*!< Transmiter/Receive's queue is not finished. */
};

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief Send a piece of data for SPI.
 *
 * This function computes the number of data to be written into D register or Tx FIFO,
 * and write the data into it. At the same time, this function updates the values in
 * master handle structure.
 *
 * @param base pointer to FLEXIO_SPI_Type structure
 * @param handle Pointer to SPI master handle structure.
 */
static void FLEXIO_SPI_TransferSendTransaction(FLEXIO_SPI_Type *base, flexio_spi_master_handle_t *handle);

/*!
 * @brief Receive a piece of data for SPI master.
 *
 * This function computes the number of data to receive from D register or Rx FIFO,
 * and write the data to destination address. At the same time, this function updates
 * the values in master handle structure.
 *
 * @param base pointer to FLEXIO_SPI_Type structure
 * @param handle Pointer to SPI master handle structure.
 */
static void FLEXIO_SPI_TransferReceiveTransaction(FLEXIO_SPI_Type *base, flexio_spi_master_handle_t *handle);

/*!
 * @brief Set the Timer 1 register TIMCFG
 *
 * This function is used for master mode. It sets the Timer 1 (used to control CS pin)
 * TIMCFG register based on CS continous mode configuration, and return the old
 * register value, for later recovery.
 *
 * @param base Pointer to FLEXIO_SPI_Type structure
 * @param csContinuous Use CS continuous mode or not.
 * @return The old TIMCFG register value.
 */
static uint32_t FLEXIO_SPI_MasterSetTimer1Cfg(FLEXIO_SPI_Type *base, bool csContinuous);

/*!
 * @brief Recover the Timer 1 register TIMCFG
 *
 * This function is used for master mode. It recovers the TIMCFG register using
 * the value got by @ref FLEXIO_SPI_MasterSetTimer1Cfg.
 *
 * @param base Pointer to FLEXIO_SPI_Type structure
 * @param The old TIMCFG register value.
 */
static void FLEXIO_SPI_MasterRecoverTimer1Cfg(FLEXIO_SPI_Type *base, uint32_t timer1Cfg);

/*!
 * @brief Force disable the Timer 1 register TIMCFG
 *
 * This function is used for master mode CS continuous mode. In this mode,
 * the timer1 is set to kFLEXIO_TimerDisableNever, so after all data transfer
 * done, this function should be called to disable the timer1.
 *
 * @param base Pointer to FLEXIO_SPI_Type structure
 */
static void FLEXIO_SPI_MasterForceDisableTimer1(FLEXIO_SPI_Type *base);

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Codes
 ******************************************************************************/

static uint32_t FLEXIO_SPI_MasterSetTimer1Cfg(FLEXIO_SPI_Type *base, bool csContinuous)
{
    uint32_t timer1Cfg = base->flexioBase->TIMCFG[base->timerIndex[1]];

    /*
     * Timer1 configuration for CS continuous and non-continuous modes.
     *
     * CS pin is configured to be logical one when timer1 enabled, so the
     * keypoint is:
     * - In CS non-continuous mode, set timers only enabled when the data frame
     *   transfer is in progress.
     * - In CS continuous mode, set timer1 always enabled during data transfer.
     *
     * Non-continuous mode:
     * In this mode, enable timer1 when timer0 is enabled, and disable timer1
     * when timer0 is disabled. Timer0 controls SCK, it is enabled/disabled
     * when a data frame starts/stops, so timer1 is only enabled when
     * one data frame transfer is in progress.
     *
     * Continuous mode:
     * In this mode, enable timer1 when timer0 is enabled, in other word, timer1
     * will be enabled at the beginning of the whole data transfer. Timer1
     * will never be disabled, until FLEXIO_SPI_MasterForceDisableTimer1 is called
     * after all data transfer done. Also, the TIMDEC is set to
     * kFLEXIO_TimerDecSrcOnPinInputShiftPinInput, so that the timer won't
     * decrease in the whole process.
     */

    if (csContinuous)
    {
        base->flexioBase->TIMCFG[base->timerIndex[1]] =
            (base->flexioBase->TIMCFG[base->timerIndex[1]] & ~(FLEXIO_TIMCFG_TIMDIS_MASK | FLEXIO_TIMCFG_TIMDEC_MASK)) |
            FLEXIO_TIMCFG_TIMDIS(kFLEXIO_TimerDisableNever) |
            FLEXIO_TIMCFG_TIMDEC(kFLEXIO_TimerDecSrcOnPinInputShiftPinInput);
    }
    else
    {
        base->flexioBase->TIMCFG[base->timerIndex[1]] =
            (base->flexioBase->TIMCFG[base->timerIndex[1]] & ~(FLEXIO_TIMCFG_TIMDIS_MASK | FLEXIO_TIMCFG_TIMDEC_MASK)) |
            FLEXIO_TIMCFG_TIMDIS(kFLEXIO_TimerDisableOnPreTimerDisable) |
            FLEXIO_TIMCFG_TIMDEC(kFLEXIO_TimerDecSrcOnFlexIOClockShiftTimerOutput);
    }

    return timer1Cfg;
}

static void FLEXIO_SPI_MasterRecoverTimer1Cfg(FLEXIO_SPI_Type *base, uint32_t timer1Cfg)
{
    base->flexioBase->TIMCFG[base->timerIndex[1]] = timer1Cfg;
}

static void FLEXIO_SPI_MasterForceDisableTimer1(FLEXIO_SPI_Type *base)
{
    uint32_t timctl = base->flexioBase->TIMCTL[base->timerIndex[1]];
    base->flexioBase->TIMCTL[base->timerIndex[1]] = timctl & (~FLEXIO_TIMCTL_TIMOD_MASK);
    base->flexioBase->TIMCTL[base->timerIndex[1]] = timctl;
}

static uint32_t FLEXIO_SPI_GetInstance(FLEXIO_SPI_Type *base)
{
    return FLEXIO_GetInstance(base->flexioBase);
}

static void FLEXIO_SPI_TransferSendTransaction(FLEXIO_SPI_Type *base, flexio_spi_master_handle_t *handle)
{
    uint32_t tmpData = FLEXIO_SPI_DUMMYDATA;

