RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_flexio_spi.c
void FLEXIO_SPI_ClearStatusFlags(FLEXIO_SPI_Type *base, uint32_t mask)
{
    if ((mask & (uint32_t)kFLEXIO_SPI_TxBufferEmptyFlag) != 0U)
    {
        FLEXIO_ClearShifterStatusFlags(base->flexioBase, 1UL << base->shifterIndex[0]);
    }
    if ((mask & (uint32_t)kFLEXIO_SPI_RxBufferFullFlag) != 0U)
    {
        FLEXIO_ClearShifterStatusFlags(base->flexioBase, 1UL << base->shifterIndex[1]);
    }
}

/*!
 * brief Sets baud rate for the FlexIO SPI transfer, which is only used for the master.
 *
 * param base Pointer to the FLEXIO_SPI_Type structure.
 * param baudRate_Bps Baud Rate needed in Hz.
 * param srcClockHz SPI source clock frequency in Hz.
 */
void FLEXIO_SPI_MasterSetBaudRate(FLEXIO_SPI_Type *base, uint32_t baudRate_Bps, uint32_t srcClockHz)
{
    uint32_t timerDiv       = 0;
    uint16_t timerCmp       = 0;
    FLEXIO_Type *flexioBase = base->flexioBase;

    /* Set TIMCMP[7:0] = (baud rate divider / 2) - 1.*/
    timerDiv = (srcClockHz / baudRate_Bps);
    timerDiv = timerDiv / 2U - 1U;

    assert(timerDiv <= UINT8_MAX);
    timerCmp = (uint16_t)(flexioBase->TIMCMP[base->timerIndex[0]]);
    timerCmp &= 0xFF00U;
    timerCmp |= (uint16_t)timerDiv;

    flexioBase->TIMCMP[base->timerIndex[0]] = timerCmp;
}

/*!
 * brief Sends a buffer of data bytes.
 *
 * note This function blocks using the polling method until all bytes have been sent.
 *
 * param base Pointer to the FLEXIO_SPI_Type structure.
 * param direction Shift direction of MSB first or LSB first.
 * param buffer The data bytes to send.
 * param size The number of data bytes to send.
 * retval kStatus_Success Successfully create the handle.
 * retval kStatus_FLEXIO_SPI_Timeout The transfer timed out and was aborted.
 */
status_t FLEXIO_SPI_WriteBlocking(FLEXIO_SPI_Type *base,
                                  flexio_spi_shift_direction_t direction,
                                  const uint8_t *buffer,
                                  size_t size)
{
    assert(buffer != NULL);
    assert(size != 0U);

#if SPI_RETRY_TIMES
    uint32_t waitTimes;
#endif

    while (0U != size--)
    {
        /* Wait until data transfer complete. */
#if SPI_RETRY_TIMES
        waitTimes = SPI_RETRY_TIMES;
        while ((0U == (FLEXIO_SPI_GetStatusFlags(base) & (uint32_t)kFLEXIO_SPI_TxBufferEmptyFlag)) &&
               (0U != --waitTimes))
#else
        while (0U == (FLEXIO_SPI_GetStatusFlags(base) & (uint32_t)kFLEXIO_SPI_TxBufferEmptyFlag))
#endif
        {
        }
#if SPI_RETRY_TIMES
        if (waitTimes == 0U)
        {
            return kStatus_FLEXIO_SPI_Timeout;
        }
#endif
        FLEXIO_SPI_WriteData(base, direction, *buffer++);
    }

    return kStatus_Success;
}

/*!
 * brief Receives a buffer of bytes.
 *
 * note This function blocks using the polling method until all bytes have been received.
 *
 * param base Pointer to the FLEXIO_SPI_Type structure.
 * param direction Shift direction of MSB first or LSB first.
 * param buffer The buffer to store the received bytes.
 * param size The number of data bytes to be received.
 * param direction Shift direction of MSB first or LSB first.
 * retval kStatus_Success Successfully create the handle.
 * retval kStatus_FLEXIO_SPI_Timeout The transfer timed out and was aborted.
 */
status_t FLEXIO_SPI_ReadBlocking(FLEXIO_SPI_Type *base,
                                 flexio_spi_shift_direction_t direction,
                                 uint8_t *buffer,
                                 size_t size)
{
    assert(buffer != NULL);
    assert(size != 0U);

#if SPI_RETRY_TIMES
    uint32_t waitTimes;
#endif

    while (0U != size--)
    {
        /* Wait until data transfer complete. */
#if SPI_RETRY_TIMES
        waitTimes = SPI_RETRY_TIMES;
        while ((0U == (FLEXIO_SPI_GetStatusFlags(base) & (uint32_t)kFLEXIO_SPI_RxBufferFullFlag)) &&
               (0U != --waitTimes))
#else
        while (0U == (FLEXIO_SPI_GetStatusFlags(base) & (uint32_t)kFLEXIO_SPI_RxBufferFullFlag))
#endif
        {
        }
#if SPI_RETRY_TIMES
        if (waitTimes == 0U)
        {
            return kStatus_FLEXIO_SPI_Timeout;
        }
#endif
        *buffer++ = (uint8_t)FLEXIO_SPI_ReadData(base, direction);
    }

    return kStatus_Success;
}

/*!
 * brief Receives a buffer of bytes.
 *
 * note This function blocks via polling until all bytes have been received.
 *
 * param base pointer to FLEXIO_SPI_Type structure
 * param xfer FlexIO SPI transfer structure, see #flexio_spi_transfer_t.
 * retval kStatus_Success Successfully create the handle.
 * retval kStatus_FLEXIO_SPI_Timeout The transfer timed out and was aborted.
 */
status_t FLEXIO_SPI_MasterTransferBlocking(FLEXIO_SPI_Type *base, flexio_spi_transfer_t *xfer)
{
    flexio_spi_shift_direction_t direction;
    uint8_t bytesPerFrame;
    uint32_t dataMode  = 0;
    uint16_t timerCmp  = (uint16_t)(base->flexioBase->TIMCMP[base->timerIndex[0]]);
    uint32_t tmpData   = FLEXIO_SPI_DUMMYDATA;
    uint8_t dataFormat = FLEXIO_SPI_XFER_DATA_FORMAT(xfer->flags);
#if SPI_RETRY_TIMES
    uint32_t waitTimes;
#endif
    status_t status = kStatus_Success;
    bool isCsContinuous = ((xfer->flags & (uint8_t)kFLEXIO_SPI_csContinuous) != 0U);

    timerCmp &= 0x00FFU;
    uint32_t timer1Cfg;

    /* Configure the values in handle. */
    switch (dataFormat)
    {
        case (uint8_t)kFLEXIO_SPI_8bitMsb:
            dataMode      = (8UL * 2UL - 1UL) << 8U;
            bytesPerFrame = 1U;
            direction     = kFLEXIO_SPI_MsbFirst;
            break;

        case (uint8_t)kFLEXIO_SPI_8bitLsb:
            dataMode      = (8UL * 2UL - 1UL) << 8U;
            bytesPerFrame = 1U;
            direction     = kFLEXIO_SPI_LsbFirst;
            break;

        case (uint8_t)kFLEXIO_SPI_16bitMsb:
            dataMode      = (16UL * 2UL - 1UL) << 8U;
            bytesPerFrame = 2U;
            direction     = kFLEXIO_SPI_MsbFirst;
            break;

        case (uint8_t)kFLEXIO_SPI_16bitLsb:
            dataMode      = (16UL * 2UL - 1UL) << 8U;
            bytesPerFrame = 2U;
            direction     = kFLEXIO_SPI_LsbFirst;
            break;

        case (uint8_t)kFLEXIO_SPI_32bitMsb:
            dataMode      = (32UL * 2UL - 1UL) << 8U;
            bytesPerFrame = 4U;
            direction     = kFLEXIO_SPI_MsbFirst;
            break;

        case (uint8_t)kFLEXIO_SPI_32bitLsb:
            dataMode      = (32UL * 2UL - 1UL) << 8U;
            bytesPerFrame = 4U;
            direction     = kFLEXIO_SPI_LsbFirst;
            break;

        default:
            dataMode      = (8UL * 2UL - 1UL) << 8U;
            bytesPerFrame = 1U;
            direction     = kFLEXIO_SPI_MsbFirst;
            assert(true);
            break;
    }

    dataMode |= timerCmp;

    /* Transfer size should be bytesPerFrame divisible. */
    if ((xfer->dataSize % bytesPerFrame) != 0U)
    {
        return kStatus_InvalidArgument;
    }

