RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_flexio_spi.c
    timer1Cfg = FLEXIO_SPI_MasterSetTimer1Cfg(base, isCsContinuous);

    /* Configure transfer size. */
    base->flexioBase->TIMCMP[base->timerIndex[0]] = dataMode;

    while (xfer->dataSize != 0U)
    {
        /* Wait until data transfer complete. */
#if SPI_RETRY_TIMES
        waitTimes = SPI_RETRY_TIMES;
        while ((0U == (FLEXIO_SPI_GetStatusFlags(base) & (uint32_t)kFLEXIO_SPI_TxBufferEmptyFlag)) &&
               (0U != --waitTimes))
#else
        while (0U == (FLEXIO_SPI_GetStatusFlags(base) & (uint32_t)kFLEXIO_SPI_TxBufferEmptyFlag))
#endif
        {
        }
#if SPI_RETRY_TIMES
        if (waitTimes == 0U)
        {
            status = kStatus_FLEXIO_SPI_Timeout;
            break;
        }
#endif
        if (xfer->txData != NULL)
        {
            /* Transmit data and update tx size/buff. */
            if (bytesPerFrame == 1U)
            {
                tmpData = (uint32_t) * (xfer->txData);
                xfer->txData++;
            }
            else if (bytesPerFrame == 2U)
            {
                if (direction == kFLEXIO_SPI_MsbFirst)
                {
                    tmpData = (uint32_t)(xfer->txData[0]) << 8U;
                    tmpData |= (uint32_t)xfer->txData[1];
                }
                else
                {
                    tmpData = (uint32_t)(xfer->txData[1]) << 8U;
                    tmpData |= (uint32_t)xfer->txData[0];
                }
                xfer->txData += 2U;
            }
            else
            {
                if (direction == kFLEXIO_SPI_MsbFirst)
                {
                    tmpData = (uint32_t)(xfer->txData[0]) << 24U;
                    tmpData |= (uint32_t)(xfer->txData[1]) << 16U;
                    tmpData |= (uint32_t)(xfer->txData[2]) << 8U;
                    tmpData |= (uint32_t)xfer->txData[3];
                }
                else
                {
                    tmpData = (uint32_t)(xfer->txData[3]) << 24U;
                    tmpData |= (uint32_t)(xfer->txData[2]) << 16U;
                    tmpData |= (uint32_t)(xfer->txData[1]) << 8U;
                    tmpData |= (uint32_t)xfer->txData[0];
                }
                xfer->txData += 4U;
            }
        }
        else
        {
            tmpData = FLEXIO_SPI_DUMMYDATA;
        }

        xfer->dataSize -= bytesPerFrame;

        FLEXIO_SPI_WriteData(base, direction, tmpData);

#if SPI_RETRY_TIMES
        waitTimes = SPI_RETRY_TIMES;
        while ((0U == (FLEXIO_SPI_GetStatusFlags(base) & (uint32_t)kFLEXIO_SPI_RxBufferFullFlag)) &&
               (0U != --waitTimes))
#else
        while (0U == (FLEXIO_SPI_GetStatusFlags(base) & (uint32_t)kFLEXIO_SPI_RxBufferFullFlag))
#endif
        {
        }
#if SPI_RETRY_TIMES
        if (waitTimes == 0U)
        {
            status = kStatus_FLEXIO_SPI_Timeout;
            break;
        }
#endif
        tmpData = FLEXIO_SPI_ReadData(base, direction);

        if (xfer->rxData != NULL)
        {
            if (bytesPerFrame == 1U)
            {
                *xfer->rxData = (uint8_t)tmpData;
            }
            else if (bytesPerFrame == 2U)
            {
                if (direction == kFLEXIO_SPI_LsbFirst)
                {
                    *xfer->rxData = (uint8_t)(tmpData >> 8);
                    xfer->rxData++;
                    *xfer->rxData = (uint8_t)tmpData;
                }
                else
                {
                    *xfer->rxData = (uint8_t)tmpData;
                    xfer->rxData++;
                    *xfer->rxData = (uint8_t)(tmpData >> 8);
                }
            }
            else
            {
                if (direction == kFLEXIO_SPI_LsbFirst)
                {
                    *xfer->rxData = (uint8_t)(tmpData >> 24U);
                    xfer->rxData++;
                    *xfer->rxData = (uint8_t)(tmpData >> 16U);
                    xfer->rxData++;
                    *xfer->rxData = (uint8_t)(tmpData >> 8U);
                    xfer->rxData++;
                    *xfer->rxData = (uint8_t)tmpData;
                }
                else
                {
                    *xfer->rxData = (uint8_t)tmpData;
                    xfer->rxData++;
                    *xfer->rxData = (uint8_t)(tmpData >> 8U);
                    xfer->rxData++;
                    *xfer->rxData = (uint8_t)(tmpData >> 16U);
                    xfer->rxData++;
                    *xfer->rxData = (uint8_t)(tmpData >> 24U);
                }
            }
            xfer->rxData++;
        }
    }

    if (isCsContinuous)
    {
        FLEXIO_SPI_MasterForceDisableTimer1(base);
    }

    FLEXIO_SPI_MasterRecoverTimer1Cfg(base, timer1Cfg);

    return status;
}

/*!
 * brief Initializes the FlexIO SPI Master handle, which is used in transactional functions.
 *
 * param base Pointer to the FLEXIO_SPI_Type structure.
 * param handle Pointer to the flexio_spi_master_handle_t structure to store the transfer state.
 * param callback The callback function.
 * param userData The parameter of the callback function.
 * retval kStatus_Success Successfully create the handle.
 * retval kStatus_OutOfRange The FlexIO type/handle/ISR table out of range.
 */
status_t FLEXIO_SPI_MasterTransferCreateHandle(FLEXIO_SPI_Type *base,
                                               flexio_spi_master_handle_t *handle,
                                               flexio_spi_master_transfer_callback_t callback,
                                               void *userData)
{
    assert(handle != NULL);

#if defined(FLEXIO_IRQS)
    IRQn_Type flexio_irqs[] = FLEXIO_IRQS;
#endif

    /* Zero the handle. */
    (void)memset(handle, 0, sizeof(*handle));

    /* Register callback and userData. */
    handle->callback = callback;
    handle->userData = userData;

#if defined(FLEXIO_IRQS)
    /* Clear pending NVIC IRQ before enable NVIC IRQ. */
    NVIC_ClearPendingIRQ(flexio_irqs[FLEXIO_SPI_GetInstance(base)]);
    /* Enable interrupt in NVIC. */
    (void)EnableIRQ(flexio_irqs[FLEXIO_SPI_GetInstance(base)]);
#endif

    /* Save the context in global variables to support the double weak mechanism. */
    return FLEXIO_RegisterHandleIRQ(base, handle, FLEXIO_SPI_MasterTransferHandleIRQ);
}

/*!
 * brief Master transfer data using IRQ.
 *
 * This function sends data using IRQ. This is a non-blocking function, which returns
 * right away. When all data is sent out/received, the callback function is called.
 *
 * param base Pointer to the FLEXIO_SPI_Type structure.
 * param handle Pointer to the flexio_spi_master_handle_t structure to store the transfer state.
 * param xfer FlexIO SPI transfer structure. See #flexio_spi_transfer_t.
 * retval kStatus_Success Successfully start a transfer.
 * retval kStatus_InvalidArgument Input argument is invalid.
 * retval kStatus_FLEXIO_SPI_Busy SPI is not idle, is running another transfer.
 */
status_t FLEXIO_SPI_MasterTransferNonBlocking(FLEXIO_SPI_Type *base,
                                              flexio_spi_master_handle_t *handle,
                                              flexio_spi_transfer_t *xfer)
{
    assert(handle != NULL);
    assert(xfer != NULL);

    uint32_t dataMode  = 0;
    uint16_t timerCmp  = (uint16_t)base->flexioBase->TIMCMP[base->timerIndex[0]];
    uint32_t tmpData   = FLEXIO_SPI_DUMMYDATA;
    uint8_t dataFormat = FLEXIO_SPI_XFER_DATA_FORMAT(xfer->flags);

    timerCmp &= 0x00FFU;

    /* Check if SPI is busy. */
    if (handle->state == (uint32_t)kFLEXIO_SPI_Busy)
    {
        return kStatus_FLEXIO_SPI_Busy;
    }

    /* Check if the argument is legal. */
    if ((xfer->txData == NULL) && (xfer->rxData == NULL))
    {
        return kStatus_InvalidArgument;
    }

